       IDENTIFICATION DIVISION.
       PROGRAM-ID. CUSTOMER.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT CUSTOMER-FILE ASSIGN TO "CUSTOMER.DAT".
       DATA DIVISION.
       FILE SECTION.
       FD CUSTOMER-FILE.
       WORKING-STORAGE SECTION.
       COPY CUSTREC.
       PROCEDURE DIVISION.
       MAIN-PARA.
           CALL "VALIDATE-CUSTOMER".
           EXEC SQL
              SELECT NAME INTO :WS-NAME FROM CUSTOMER
           END-EXEC.
           STOP RUN.
